app/views/users/show.html.erb

SELECT "events".* FROM "events" INNER JOIN "invites" ON "events"."id" = "invites"."event_id" WHERE "invites"."user_id" = $1  [["user_id", 33]]
---
<tbody>
  <% @user.events.each do |event| %>