app/views/events/_form.html.erb

  <%= form.label "Guest List" %>
  <%= form.collection_check_boxes :invites, User.all, :id, :name do |b| %>
---
SELECT "users".* FROM "users"