app/helpers/users_helper.rb

  def show_created(user)
    @tr_content = content_tag(:div)
    user.events.uniq.each do |event|
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 28]]