app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (time >= '2020-09-10 09:17:00.778910') ORDER BY time ASC
---
  def index
    @events = Event.all

SELECT "invites".* FROM "invites"
---
  def show
    @invites = Invite.all

SELECT "users".* FROM "users"
---
  def new
    if current_user
      @event = Event.new
      @users = User.all

SELECT "users".* FROM "users"
---
  def edit
    @users = User.all

SELECT "users".* FROM "users"
INSERT INTO "invites" ("event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 64], ["user_id", 28], ["created_at", "2020-09-09 12:11:25.633226"], ["updated_at", "2020-09-09 12:11:25.633226"]]
INSERT INTO "events" ("location", "title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["location", ""], ["title", ""], ["description", ""], ["created_at", "2020-09-10 11:55:01.816852"], ["updated_at", "2020-09-10 11:55:01.816852"], ["user_id", 28]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "invites" ("created_at", "updated_at", "event_id", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2020-09-10 10:08:05.206718"], ["updated_at", "2020-09-10 10:08:05.206718"], ["event_id", 7], ["user_id", 1]]
---
  def create
    @users = User.all

    @event = current_user.events.build(event_params.except(:invites))

    respond_to do |format|
      if @event.save

        event_params.slice(:invites).values.each do |x|
          x.each do |y|
            if y.empty?
            else
              user = @users.find(y.to_i)
              @event.attendees << user

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
INSERT INTO "invites" ("event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 160], ["user_id", 32], ["created_at", "2020-09-10 12:05:35.711204"], ["updated_at", "2020-09-10 12:05:35.711204"]]
---
  def update
    @users = User.all
    respond_to do |format|
      if @event.update(event_params.except(:invites))

        event_params.slice(:invites).values.each do |x|
          x.each do |y|
            if y.empty?
            else
              user = @users.find(y.to_i)
              @event.attendees << user