app/controllers/events_controller.rb

  def update
    @users = User.all
    respond_to do |format|
      if @event.update(event_params.except(:invites))

        event_params.slice(:invites).values.each do |x|
          x.each do |y|
            if y.empty?
            else
              user = @users.find(y.to_i) # unless y.strip.empty?
              @event.attendees << user
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "invites" ("created_at", "updated_at", "event_id", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2020-09-10 08:52:32.429719"], ["updated_at", "2020-09-10 08:52:32.429719"], ["event_id", 5], ["user_id", 1]]