app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if current_user
      @users = User.all

SELECT "invites".* FROM "invites"
---
  def show
    set_user
    @invites = Invite.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "me"], ["email", "me@me.com"], ["created_at", "2020-09-08 06:54:29.900305"], ["updated_at", "2020-09-08 06:54:29.900305"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save